In [1]:
import numpy as np
import pandas as pd

In [14]:
df=pd.read_excel("/content/Medals.xlsx",index_col='Rank')
# MEDALS
df.columns

Index(['Team/NOC', 'Gold', 'Silver', 'Bronze', 'Total', 'Rank by Total'], dtype='object')

In [15]:
df.drop(df.columns[5],axis=1 ,inplace=True)

In [16]:
df.columns = ['Davlat','Oltin','Kumush','Bronza','Umumiy']
df.sort_values(by='Davlat')

# Janubiy Koreya va Uzbekistan davlatlarining Olimpiya o'yinlaridagi data analizlari

                        Davlat  Oltin  Kumush  Bronza  Umumiy
Rank
72                   Argentina      0       1       2       3
69                     Armenia      0       2       2       4
6                    Australia     17       7      22      46
53                     Austria      1       1       5       7
67                  Azerbaijan      0       3       4       7
...                        ...    ...     ...     ...     ...
36                      Uganda      2       1       1       4
44                     Ukraine      1       6      12      19
1     United States of America     39      41      33     113
32                  Uzbekistan      3       0       2       5
46                   Venezuela      1       3       0       4

[93 rows x 5 columns]

In [35]:
df_kor= df[df.Davlat=='Republic of Korea']
df_kor

                 Davlat  Oltin  Kumush  Bronza  Umumiy
Rank
16    Republic of Korea      6       4      10      20

In [38]:
df_uz = df[df['Davlat']=='Uzbekistan']
df_uz

          Davlat  Oltin  Kumush  Bronza  Umumiy
Rank
32    Uzbekistan      3       0       2       5

In [ ]:
df.describe()

In [ ]:
df['Kumush'].corr(df['Bronza'])

0.862646332050399

In [ ]:
df_kor = df[df['Davlat']=='Republic of Korea']
df_kor

                 Davlat  Oltin  Kumush  Bronza  Umumiy
Rank
16    Republic of Korea      6       4      10      20

In [3]:
# Atthletes

at_df = pd.read_excel("/content/Athletes.xlsx")

In [6]:
at_df.columns = ['ism','davlat','sport']

In [7]:
at_df.index.name = 'rank'

In [ ]:
at_df.sport.value_counts()

In [57]:
kor_sonsu = at_df[at_df.davlat == 'Republic of Korea']
kor_foot = kor_sonsu[kor_sonsu.sport == 'Football']
kor_foot

                  ism             davlat     sport
rank
4160       HWANG Uijo  Republic of Korea  Football
4406   JEONG Seungwon  Republic of Korea  Football
4407    JEONG Taewook  Republic of Korea  Football
4594   KANG Yoonseong  Republic of Korea  Football
4823     KIM Donghyun  Republic of Korea  Football
4833       KIM Jaewoo  Republic of Korea  Football
4834       KIM Jingyu  Republic of Korea  Football
4836        KIM Jinya  Republic of Korea  Football
5246   KWON Changhoon  Republic of Korea  Football
5402   LEE Donggyeong  Republic of Korea  Football
5403      LEE Dongjun  Republic of Korea  Football
5416       LEE Kangin  Republic of Korea  Football
5426      LEE Sangmin  Republic of Korea  Football
5435     LEE Youhyeon  Republic of Korea  Football
7448        PARK Jisu  Republic of Korea  Football
8838    SEOL Youngwoo  Republic of Korea  Football
9184     SONG Bumkeun  Republic of Korea  Football
9188      SONG Minkyu  Republic of Korea  Football
9968       UM Wonsang  Republic of Korea  Football
10649       WON Dujae  Republic of Korea  Football

In [ ]:
uzb = at_df[at_df.davlat == 'Uzbekistan']
uzb[uzb.sport=='Boxing'].value_counts()

ism                       davlat      sport
ZOIROV Shakhobidin        Uzbekistan  Boxing    1
YUNUSOVA Shakhnoza        Uzbekistan  Boxing    1
TURSUNOV Sanjar           Uzbekistan  Boxing    1
RUZMETOV Dilshod          Uzbekistan  Boxing    1
RAKHIMOVA Tursunoy        Uzbekistan  Boxing    1
MIRZAKHALILOV Mirazizbek  Uzbekistan  Boxing    1
KODIROVA Raykhona         Uzbekistan  Boxing    1
KAKHRAMONOV Fanat         Uzbekistan  Boxing    1
JALOLOV Bakhodir          Uzbekistan  Boxing    1
BATUROV Bobo-Usmon        Uzbekistan  Boxing    1
ABDURAIMOV Elnur          Uzbekistan  Boxing    1
dtype: int64

In [ ]:


# GENDER

In [58]:
df_gender = pd.read_excel("/content/EntriesGender.xlsx")

In [59]:
df_gender

               Discipline  Female  Male  Total
0          3x3 Basketball      32    32     64
1                 Archery      64    64    128
2     Artistic Gymnastics      98    98    196
3       Artistic Swimming     105     0    105
4               Athletics     969  1072   2041
5               Badminton      86    87    173
6       Baseball/Softball      90   144    234
7              Basketball     144   144    288
8        Beach Volleyball      48    48     96
9                  Boxing     102   187    289
10           Canoe Slalom      41    41     82
11           Canoe Sprint     123   126    249
12  Cycling BMX Freestyle      10     9     19
13     Cycling BMX Racing      24    24     48
14  Cycling Mountain Bike      38    38     76
15           Cycling Road      70   131    201
16          Cycling Track      90    99    189
17                 Diving      72    71    143
18             Equestrian      73   125    198
19                Fencing     107   108    215
20               Football     264   344    608
21                   Golf      60    60    120
22               Handball     168   168    336
23                 Hockey     192   192    384
24                   Judo     192   201    393
25                 Karate      40    42     82
26      Marathon Swimming      25    25     50
27      Modern Pentathlon      36    36     72
28    Rhythmic Gymnastics      96     0     96
29                 Rowing     257   265    522
30           Rugby Sevens     146   151    297
31                Sailing     175   175    350
32               Shooting     178   178    356
33          Skateboarding      40    40     80
34         Sport Climbing      20    20     40
35                Surfing      20    20     40
36               Swimming     361   418    779
37           Table Tennis      86    86    172
38              Taekwondo      65    65    130
39                 Tennis      94    97    191
40  Trampoline Gymnastics      16    16     32
41              Triathlon      55    55    110
42             Volleyball     144   144    288
43             Water Polo     122   146    268
44          Weightlifting      98    99    197
45              Wrestling      96   193    289

In [80]:
df_teams = pd.read_excel("/content/Teams.xlsx")

In [81]:
df_teams.columns

Index(['Name', 'Discipline', 'NOC', 'Event'], dtype='object')

In [82]:
df_teams.drop('NOC',axis='columns',inplace=True)

In [83]:
df_teams['Event'].value_counts()

Men                                 120
Women                               114
Men's Team                           40
Women's Team                         40
Mixed Team                           29
Duet                                 22
Mixed Relay                          18
Women's 4 x 200m Freestyle Relay     17
Men's 4 x 100m Relay                 16
Mixed 4 x 100m Medley Relay          16
Men's Madison                        16
Men's 4 x 200m Freestyle Relay       16
Men's 4 x 100m Medley Relay          16
Men's 4 x 100m Freestyle Relay       16
Mixed Doubles                        16
Men's 4 x 400m Relay                 16
Women's 4 x 100m Freestyle Relay     16
Women's Madison                      16
Women's 4 x 100m Relay               16
Women's 4 x 100m Medley Relay        16
Women's 4 x 400m Relay               16
4 x 400m Relay Mixed                 15
Group All-Around                     14
Team                                 10
Men's Épée Team                       9
Men's Sabre Team                      9
Women's Sabre Team                    9
Men's Foil Team                       9
Men's Team Pursuit                    8
Women's Team Sprint                   8
Women's Foil Team                     8
Men's Team Sprint                     8
Women's Épée Team                     8
Women's Team Pursuit                  8
Baseball                              6
Softball                              6
Name: Event, dtype: int64

In [84]:
team_kr=df_teams[df_teams['Name']=='Republic of Korea']

In [85]:
team_kr['Event'].value_counts()

Women                               3
Men                                 2
Men's Team                          2
Women's Team                        2
Mixed Team                          1
Women's Sabre Team                  1
Men's 4 x 200m Freestyle Relay      1
Men's Sabre Team                    1
Women's 4 x 200m Freestyle Relay    1
Men's Épée Team                     1
Baseball                            1
Women's Épée Team                   1
Name: Event, dtype: int64

In [91]:
df_coac = pd.read_excel("/content/Coaches.xlsx")

In [97]:
df_coac[df_coac['NOC']=='Republic of Korea']

                 Name                NOC         Discipline     Event
61        CHOI Il Eon  Republic of Korea  Baseball/Softball  Baseball
62       CHUN Jooweon  Republic of Korea         Basketball     Women
186      KANG Jae Won  Republic of Korea           Handball     Women
192       KIM Chanbin  Republic of Korea           Football       NaN
193        KIM Hagbum  Republic of Korea           Football       Men
213  LAVARINI Stefano  Republic of Korea         Volleyball     Women
324       SEO Chun Oh  Republic of Korea       Rugby Sevens       Men